tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "universal-ctags/universal-ctags"
# Library for command-line editing
brew "readline"
# Emacs dependency management
brew "cask"
# Dependency manager for Cocoa projects
brew "cocoapods"
# General-purpose data compression with high compression ratio
brew "xz"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node@10"
# Python version management
brew "pyenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Code-search similar to ack
brew "the_silver_searcher"
# General-purpose lossless data-compression library
brew "zlib"
# Maintained ctags implementation
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
# Text editor
cask "emacs"
# Open-source code editor
cask "visual-studio-code"
